---
kind: property
id: P:Autodesk.Revit.DB.VertexIndexPair.Top
source: html/65929cf7-d674-c43f-44cc-7c1d6633329b.htm
---
# Autodesk.Revit.DB.VertexIndexPair.Top Property

The index of the vertex pair from the top profile.

## Syntax (C#)
```csharp
public int Top { get; set; }
```